In [1]:
import pandas as pd

In [3]:
data = [
    (1,4,7,9),
    (56,89,76,30),
    (21,54,98,24),
    (122,90,33,89)
]

df = pd.DataFrame(data = data, index = ("L1 L2 L3 L4").split(), columns = ("C1 C2 C3 C4").split())
df

     C1  C2  C3  C4
L1    1   4   7   9
L2   56  89  76  30
L3   21  54  98  24
L4  122  90  33  89

In [4]:
df['C1']

L1      1
L2     56
L3     21
L4    122
Name: C1, dtype: int64

In [5]:
type(df['C1'])

pandas.core.series.Series

In [6]:
df[['C3','C1']]

    C3   C1
L1   7    1
L2  76   56
L3  98   21
L4  33  122

In [7]:
type(df[['C3','C1']])

pandas.core.frame.DataFrame

In [8]:
df[:]

     C1  C2  C3  C4
L1    1   4   7   9
L2   56  89  76  30
L3   21  54  98  24
L4  122  90  33  89

In [9]:
df[1:]

     C1  C2  C3  C4
L2   56  89  76  30
L3   21  54  98  24
L4  122  90  33  89

In [10]:
df[1:3]

    C1  C2  C3  C4
L2  56  89  76  30
L3  21  54  98  24

In [11]:
df[1:3][['C2', 'C3']]

    C2  C3
L2  89  76
L3  54  98

## Utilizando Loc

In [12]:
df

     C1  C2  C3  C4
L1    1   4   7   9
L2   56  89  76  30
L3   21  54  98  24
L4  122  90  33  89

In [18]:
df.loc['L3']

C1    21
C2    54
C3    98
C4    24
Name: L3, dtype: int64

In [15]:
df.loc[['L3', 'L1']]

    C1  C2  C3  C4
L3  21  54  98  24
L1   1   4   7   9

In [16]:
df.loc['L3', 'C3']

98

## iLoc é o mesmo do Loc só que com o indice numerico